#include <stdio.h>

void main_view(void)
{
	printf("\033[0;34m**********彩票管理系统**********\033[0;m\n");
	printf("\033[0;35m1.用户注册\033[0;m\n");
	printf("\033[0;35m2.用户登录\033[0;m\n");
	printf("\033[0;35m3.管理员登录\033[0;m\n");
	printf("\033[0;35m4.公正员登录\033[0;m\n");
	printf("\033[0;31m0.退出系统\033[0;m\n");
}
/**********************************************************/
void user_view(void)
{
	printf("\033[0;34m**********彩票管理系统**********\033[0;m\n");
	printf("\033[0;35m1.查看个人信息\033[0;m\n");
	printf("\033[0;35m2.修改密码\033[0;m\n");
	printf("\033[0;35m3.修改用户名\033[0;m\n");
	printf("\033[0;35m4.账户充值\033[0;m\n");
	printf("\033[0;35m5.购买彩票\033[0;m\n");
	printf("\033[0;35m6.查看历史记录\033[0;m\n");
	printf("\033[0;35m7.注销账户\033[0;m\n");
	printf("\033[0;31m0.返回上一级菜单\033[0;m\n");
}
/********************************************************/
void admin_view(void)
{	
	printf("\033[0;34m**********彩票管理系统**********\033[0;m\n");
	printf("\033[0;35m1.查询用户信息\033[0;m\n");
	printf("\033[0;35m2.发行彩票\033[0;m\n");
	printf("\033[0;35m3.查看所有用户信息\033[0;m\n");//下一级菜单：选择某种方式查看
	printf("\033[0;35m4.找回账户\033[0;m\n");
	printf("\033[0;31m0.返回上一级菜单\033[0;m\n");
}

void sort_all_user_view(void)
{
	printf("\033[0;34m**********彩票管理系统**********\033[0;m\n");
	printf("\033[0;36m1.按注册时间顺序查看中奖概况\033[0;m\n");
	printf("\033[0;36m2.查看升序金额并划出区间\033[0;m\n");
	printf("\033[0;36m3.查看注销账户\033[0;m\n");
	printf("\033[0;31m0.返回上一级菜单\033[0;m\n");
}

/*******************************************************/
void notary_view(void)
{
	printf("\033[0;34m**********彩票管理系统**********\033[0;m\n");
	printf("\033[0;35m1.开奖\033[0;m\n");
	printf("\033[0;35m2.查看彩票信息\033[0;m\n");
	printf("\033[0;31m0.返回上一级菜单\033[0;m\n");
}
